In [306]:
import matplotlib.pyplot as plt
from matplotlib import style
style.use('ggplot')
import numpy as np
import pandas as pd
from sklearn.cluster import KMeans
from sklearn.model_selection import train_test_split
from sklearn import preprocessing

In [307]:
df=pd.read_excel('titanic.xls',header=0)

In [308]:
df.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

### Data Descriptors

| Variable | Definition | Key |
| ----| ----| ----|
| pclass   | Ticket class | 1 = 1st, 2 = 2nd, 3 = 3rd |
| survived | survived | 0 = No, 1 = Yes |
| name | name |  |
| sex | sex |  |
| age | Age |  |
| sibsp | # of siblings / spouses aboard the Titanic | |
| parch | # of parents / children aboard the Titanic | |
| ticket | Ticket number | |
| fare | Passenger fare | |
| cabin | Cabin number | |
| embarked | Port of Embarkation | C = Cherbourg, Q = Queenstown, S = Southampton |
| boat | Lifeboat | |
| body | Body Identification Number | |
| home.dest | Home/Destination | |

In [309]:
df.drop(['body','name'],1,inplace=True)
df.head()

,pclass,survived,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,home.dest
0,1,1,female,29.0000,0,0,24160,211.3375,B5,S,2,"St Louis, MO"
1,1,1,male,0.9167,1,2,113781,151.5500,C22 C26,S,11,"Montreal, PQ / Chesterville, ON"
2,1,0,female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,"Montreal, PQ / Chesterville, ON"
4,1,0,female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,"Montreal, PQ / Chesterville, ON"

In [310]:
from sklearn.preprocessing import LabelEncoder
number=LabelEncoder()
df['ticket']=number.fit_transform(df['ticket'].astype('str'))
df['cabin']=number.fit_transform(df['cabin'].astype('str'))
df.head()

,pclass,survived,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,home.dest
0,1,1,female,29.0000,0,0,187,211.3375,43,S,2,"St Louis, MO"
1,1,1,male,0.9167,1,2,49,151.5500,79,S,11,"Montreal, PQ / Chesterville, ON"
2,1,0,female,2.0000,1,2,49,151.5500,79,S,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,male,30.0000,1,2,49,151.5500,79,S,NaN,"Montreal, PQ / Chesterville, ON"
4,1,0,female,25.0000,1,2,49,151.5500,79,S,NaN,"Montreal, PQ / Chesterville, ON"

In [311]:
df['home.dest'].nunique()

369

In [312]:
df.drop(['home.dest'],1,inplace=True)

In [313]:
df=pd.get_dummies(data=df,drop_first=True)
df.head()

,pclass,survived,age,sibsp,parch,ticket,fare,cabin,sex_male,boat_1,...,boat_6,boat_7,boat_8,boat_8 10,boat_9,boat_A,boat_B,boat_C,boat_C D,boat_D
0,1,1,29.0000,0,0,187,211.3375,43,0,0,...,0,0,0,0,0,0,0,0,0,0
1,1,1,0.9167,1,2,49,151.5500,79,1,0,...,0,0,0,0,0,0,0,0,0,0
2,1,0,2.0000,1,2,49,151.5500,79,0,0,...,0,0,0,0,0,0,0,0,0,0
3,1,0,30.0000,1,2,49,151.5500,79,1,0,...,0,0,0,0,0,0,0,0,0,0
4,1,0,25.0000,1,2,49,151.5500,79,0,0,...,0,0,0,0,0,0,0,0,0,0

In [314]:
df.isnull().values.any()

True

In [315]:
df.fillna(0,inplace=True)

In [316]:
df.isnull().values.any()

False

In [317]:
X=np.array(df.drop(['survived'],1))
X=preprocessing.scale(X)

In [318]:
y=np.array(df['survived'])

In [319]:
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2)

In [320]:
clf=KMeans(n_clusters=2)

In [321]:
clf.fit(X)

KMeans(algorithm='auto', copy_x=True, init='k-means++', max_iter=300,
    n_clusters=2, n_init=10, n_jobs=1, precompute_distances='auto',
    random_state=None, tol=0.0001, verbose=0)

In [322]:
correct=0
for i in range(len(X)):
    predict_me=np.array(X[i].astype(float))
    predict_me=predict_me.reshape(-1,len(predict_me))
    prediction=clf.predict(predict_me)
    if prediction[0]==y[i]:
        correct+=1
print(correct/len(X))

0.6997708174178763